---
kind: other
id: Methods.T:Autodesk.Revit.DB.BaseImportOptions
source: html/214ade08-caf1-7a07-9cad-8162e33039b5.htm
---
# BaseImportOptions Methods

Get the default length unit used for importing unitless files.